/*За да го претставиме природниот број n како производ од прости множители, можеме да 
следиме постапката на разлагање на бројот на прости множители.

Прво, треба да ги најдеме сите прости множители на бројот n. За тоа, можеме да ги итерираме сите броеви од 2 до n и да го
 провериме дали бројот е прост делител на n.
 Ако е прост делител на n, тогаш го додаваме во список на прости множители и го делиме n со тој делител додека не остане 1.

Откако ги најдеме сите прости множители, треба да го одредиме колку пати секој од нив се појавува во бројот n. 
За тоа, можеме да го итерираме списокот на прости множители и да го делиме n со тој множител додека можеме да го делиме. 
Секој пат кога го делиме n со прост делител, го зголемуваме бројачот за тој делител.

*/
#include <stdio.h>

int main()
{
    int n, i, j;
    printf("Внесете го природниот број n: ");
    scanf("%d", &n);

    printf("%d = ", n);

    // Итерирај ги сите можни делители на n
    for (i = 2; i <= n; i++)
    {
        int count = 0;

        // Додека i е делител на n, дели го n со i и зголеми го бројачот за i
        while (n % i == 0)
        {
            count++;
            n /= i;
        }

        // Ако i е делител на n, тогаш го печати како множител и соодветната степен
        if (count > 0)
        {
            printf("%d^%d ", i, count);
        }
    }

    return 0;
}